<template>
	<view class="page" :data-theme='themeType'>
		<view class="sy_title_primary">
		<!-- #ifdef APP-PLUS||H5 --> 
		<view class="Alltitle sy_title_deep" style="">
			<text>树蚁医疗APP隐私保护政策</text>
		</view>
		<view class="time">
			<text>版本发布日期：2021年6月1日</text><br/>
			<text>版本生效日期：2021年6月1日</text>
		</view>
		<view class="subtitle sy_title_deep">
			<text class="">引言：</text>
		</view>
		<view style="text-indent: 30px;text-align: left;" class=""> 广州诺曼数字化医疗科技有限公司及其关联公司（以下简称我们）重视用户的隐私。您在使用我们的服务时，我们可能会收集和使用您的相关信息。我们希望通过本《隐私政策》向您说明，在使用我们的服务时，我们如何收集、使用、储存和分享这些信息，以及我们为您提供的访问、更新、控制和保护这些信息的方式。本《隐私政策》与您所使用的服务息息相关，希望您仔细阅读，在需要时，按照本《隐私政策》的指引，作出您认为适当的选择。本《隐私政策》中涉及的相关技术词汇，我们尽量以简明扼要的表述，并提供进一步说明的链接，以便您的理解。<br/>您使用或继续使用我们的服务，即意味着同意我们按照本《隐私政策》收集、使用、储存和分享您的相关信息。</view>
		<text class="titleA sy_title_deep">一、我们如何收集和使用您的个人信息</text><br/>
		<text class="titleB sy_title_deep">（一）我们提供服务时，可能会收集、储存和使用下列与您有关的信息。如果您不提供相关信息，可能无法享受我们提供的某些服务，或者无法达到相关服务拟达到的效果。</text><br/>
		1、日志信息，指您使用我们的服务时，系统可能通过cookies、web beacon或其他方式自动采集的技术信息<br/>
		2、设备或软件信息，例如您的移动设备、网页浏览器或用于接入我们服务的其他程序所提供的配置信息、您的IP地址和移动设备所用的版本和设备识别码；<br/>
		3、在使用我们服务时搜索或浏览的信息，例如您使用的网页搜索词语、访问的社交媒体页面url地址，以及您在使用我们服务时浏览或要求提供的其他信息和内容详情；<br/>
		4、有关您曾使用的移动应用（APP）和其他软件的信息，以及您曾经使用该等移动应用和软件的信息；<br/>
		5、位置信息，指您开启设备定位功能并使用我们基于位置提供的相关服务时，收集的有关您位置的信息，包括：
		（1）您通过具有定位功能的移动设备使用我们的服务时，通过GPS或WiFi等方式收集的您的地理位置信息；
		（2）您或其他用户提供的包含您所处地理位置的实时信息，例如您提供的账户信息中包含的您所在地区信息，您或其他人上传的显示您当前或曾经所处地理位置的共享信息；
		<br/>6、监听通知栏，应用会通过第三方个推服务商推送过来的相关数据来做监听，从而为用户创建通知栏便于提醒用户相关信息；
		<br/>7、相机及摄像头权限，用于用户修改个人头像及身份证等相关信息，便于该应用进行个人信息的审核；<br/>
		8、读取存储卡中的内容，用于用户在平台上保存图片，下载文件以及APP运行时所需的内存；<br/>
		9、修改系统设置，用于用户在关闭某些权限时，为了获得某项功能服务，所需要对设备进行设置修改；<br/>
		10 录制音频，文字转语音等辅助功能；<br/>
		11 获取本地号码：便于用户更快捷登录，该功能是由Dcloud与三大运营商免验证码的手机号认证服务联合提供；<br/>
		12 我们的产品基于DCloud uni-app开发，应用运行期间需要收集您的<text class="titleB sy_title_deep">设备唯一识别码（IMEI/android ID/IDFA、SIM 卡 IMSI 信息）</text>以提供统计分析服务，并通过应用启动数据及异常错误日志分析改进性能和用户体验，为用户提供更好的服务。
		<br/><text class="titleB sy_title_deep">13  收集设备MAC地址、软件安装列表</text>等：APP在运行中会存在第三方的个推SDK收集该信息用于推送服务，应用场景如：方法库更新的推送，个人信息审核的推送，具体收集方式及范围详情见<text class="titleB sy_title_deep">下列第15款</text>对应的解释；用户使用APP时会在用户同意隐私政策之后,<text class="titleB sy_title_deep">APP会在运行时每30s读取一次位置信息</text>的权限，这是为了准确得知用户所在位置，便于进行<text class="titleB sy_title_deep">高接受率的在线推送或者厂商推送的服务</text>，使用户更快速及时获取推送的信息；后台静默获取<text class="titleB sy_title_deep">位置信息及相关设备号（如IMEI、MAC、IDFA、IMSI等），安装列表，设备信息等</text>，也是第三方的个推SDK为了衔接厂商通道的推送所做的技术服务，防止APP在离线情况下，接收不到应用推送的服务；具体关于收集设备等相关信息参考下列第15条所做的具体描述。<br/>
		<text class="titleB sy_title_deep">14 我们的产品集成友盟+SDK，友盟+SDK需要收集您的设备Mac地址、唯一设备识别码（IMEI/android ID/IDFA/OPENUDID/GUID、SIM 卡 IMSI 信息）以提供统计分析服务，并通过地理位置校准报表数据准确性，提供基础反作弊能力。</text><br/>
		<text class="titleB sy_title_deep">15 与授权合作伙伴数据共享：</text><br/>
		我们的产品中可能会包含第三方SDK或其他类似的应用程序，如您在我们应用上使用这类由第三方提供的服务时，您同意将由其直接收集和处理您的信息（如以嵌入代码、插件等形式）。我们对接入的相关第三方SDK在以下声明：
		<br/>（1）个推：由浙江每日互动网络科技股份有限公司提供推送技术服务，我们可能会将您的<text class="titleB sy_title_deep">设备平台、设备厂商、设备品牌、设备序列号、设备识别码（如IMEI、MAC、IDFA、IMSI等）等设备信息，安装列表、应用列表信息、网络信息（如IP 地址、WIFI 信息等）以及位置相关信息</text>提供给浙江每日互动网络科技股份有限公司，用于为您提供相关信息，数据等推送技术服务；例如：方法库更新的推送，关于公司新闻的推送，个人信息审核结果等推送服务；详情参考第（二）条关于获取相关信息的具体解释。（关于此产品的隐私政策条款，可参考https://docs.getui.com/privacy/）；<br/>
		<text class="titleB sy_title_deep" style="font-size: 16px;">注：</text>APP经用户同意后会存在收集安装列表、MAC以及每30s读取一次位置等信息的行为，这是因为应用运行时会自动向系统注册要使用消息推送功能引起，便于为用户提供业务相关推送服务，以及用于优化启动速度。这些数据非本应用所获取及所有，均有个推服务商所获取并应用。
		<br/><view class="titleB sy_title_deep">(二)、以下个推的隐私政策关于获取相关信息的具体解释：</view>
		<view class="titleB sy_title_deep">
			(1) 个推提供消息推送服务过程中收集和使用的信息：
		</view> 
		<text></text>1、设备信息：<text class="titleB sy_title_deep">设备识别码（是指是指如IMEI、IDFA、Android ID、MAC、OAID等设备相关信息）</text>将被用于生成唯一的推送目标ID，即CID。设备平台、设备厂商、设备品牌等设备相关信息有助于我们帮助开发者提供业务相关的推送服务和体验。<br/>
		2、<text class="titleB sy_title_deep">应用列表信息：</text>我们采用合并链路技术进行技术推送，当一个设备有多个APP的推送链路同时活跃时，我们会随机合并成一条链路，以达到为您省电省流量的目的，因此需获得应用列表信息；
		<br/>3、<text class="titleB sy_title_deep">网络信息以及位置相关信息：</text>为了最大程度保持网络连接的稳定性，建立长链接，我们需要了解设备的网络状态和变化，从而实现稳定连续的推送服务。
		<view class="titleB sy_title_deep">
		<!-- (2)个推提供个像用户画像服务过程中收集和使用的信息：
		</view>
		1、设备信息：<text class="titleB">设备识别码（是指是指如IMEI、IDFA、Android ID、MAC、OAID等设备相关信息）</text>将被用于生成唯一的用户标识，即GIUID。设备平台、设备厂商、设备品牌等设备相关信息有助于我们生成更丰富的画像，如设备品牌、设备版本等画像标签。
		2、<text class="titleB">网络信息以及位置相关信息：</text>有助于我们为开发者结合线上、线下数据提供准确的画像信息。
		<view class="titleB"> -->
		(2)个推提供个验风控和认证服务过程中收集和使用的信息：
		</view>
		1、设备信息：<text class="titleB sy_title_deep">设备识别码（是指是指如IMEI、IDFA、Android ID、MAC、OAID等设备相关信息）</text>将被用于生成唯一的客户端ID，即GYUID；设备平台、设备厂商、设备品牌、设备型号等设备相关信息有助于我们帮助开发者更好地识别当前的设备，这会提升我们的反欺诈能力。
		2、<text class="titleB sy_title_deep">应用列表信息、网络信息、加密后的登录信息以及位置相关信息：</text>我们通过上述信息分析当前设备的风险等级，可有效识别各种作弊行为，有效识别风险设备，可用于评估渠道质量，识别恶意刷量、恶意程序、保护您的账号安全等。
		<view class="titleB sy_title_deep">
		(3)个推提供个数应用统计服务过程中收集和使用的信息：
		</view>
		1、<text class="titleB sy_title_deep">设备信息：设备识别码（是指是指如IMEI、IDFA、Android ID、MAC、OAID等设备相关信息）</text>将被用于生成唯一的统计标识ID，即GCID，供系统内部使用，用做数据去重和不同维度数量统计；设备平台、设备厂商、设备品牌等设备相关信息将用于多维度的统计计算。
		<br/>2、<text class="titleB sy_title_deep">网络信息：</text>用来和个数服务器建立连接。
		<br/>3、<text class="titleB sy_title_deep">应用相关信息：</text>包括但不限于应用列表、渠道、时间戳、页面唯一标识、用户打点事件。我们使用上述信息来提供多维的统计分析，实现包括可视化埋点、行业分析在内的统计功能。
		<view class="titleB sy_title_deep">
		(4)个推提供链路调节器服务过程中收集和使用的信息：
		</view>
		　　1、设备信息：<text class="titleB sy_title_deep">设备识别码（是指是指如IMEI、IDFA、Android ID、MAC、OAID等设备相关信息）</text>将被用于生成唯一的推送目标ID，即CID。设备平台、设备厂商、设备品牌等设备相关信息有助于我们给您提供更好的推送服务和体验。
		　　<br/>2、<text class="titleB sy_title_deep">应用列表信息：</text>应用在向您推送消息时，应用可以授权我们进行链路调节，相互促活被关闭的SDK推送进程，保障您可以及时接收到应用向您推送的消息。
		　　<br/>3、<text class="titleB sy_title_deep">网络信息：</text>用来和个推服务器建立连接。
		<view class="titleB sy_title_deep">
		(5)个推提供变现服务过程中收集和使用的信息：
		</view>
		1、设备信息：<text class="titleB sy_title_deep">设备识别码（是指是指如IMEI、IDFA、Android ID、MAC、OAID等设备相关信息）</text>将被用于生成唯一的设备标识，即GTCID。设备平台、设备厂商、设备品牌等设备相关信息有助于我们帮助开发者给您提供更好的推送服务和体验。
		<br/>2、<text class="titleB sy_title_deep">应用相关信息：</text>包括但不限于应用列表、渠道、时间戳、页面唯一标识、广告事件。我们使用上述信息来提供多维的统计分析。
		<br/>3、<text class="titleB sy_title_deep">网络信息以及位置相关信息</text>：获取网络信息后，开发者可选择在wifi 条件下预加载广告，减少您移动流量的损耗。位置信息有助于我们帮助开发者减少不相关广告对您的打扰。
		<view class="titleB sy_title_deep">
		(6)关于个推如何保护您的用户信息
		</view>
		1、我们已使用符合业界标准的安全防护措施保护您的用户信息，防止数据遭到未经授权的访问、公开披露、使用、修改、损坏或丢失。我们会采取一切合理可行的措施，保护您的用户信息。例如，我们会部署访问控制机制，确保只有授权人员才可访问用户信息；以及我们会举办安全和隐私保护培训课程，加强员工对于保护用户信息重要性的认识。
		<br/>2、我们已经取得了以下认证：信息系统安全等级保护三级认证、ISO9001质量管理体系认证、ISO27001信息安全管理体系认证证书。
		<br/>3、我们的数据安全能力：我们依据《网络安全法》、《个人信息安全规范》等一系列法律法规和行业标准已先后完成了个推业务信息系统安全等级保护三级认证、数据分类分级及配套的数据安全保障技术（明确数据脱敏、存储等要求）等一系列工作，制定了《安全总纲》、《数据分类分级规范》等各种管控流程和应急响应制度等，对管理体系建设、物理环境安全、主机安全、应用系统安全、网络安全、数据安全等维度都进行了建设和落实。
		<br/>4、我们会采取一切合理可行的措施，确保不收集无关的信息。我们只会在达成本政策所述目的所需的期限内保留您的用户信息，除非需要延长保留期或受到法律法规的允许。
		<br/>5、互联网并非绝对安全的环境，而且电子邮件、即时通讯及其他交流方式并未加密，我们强烈建议您不要通过此类方式发送信息。
		<br/>6、互联网环境并非百分之百安全，我们将尽力确保您提供给我们的任何信息的安全性。即使我们做出了很大努力，采取了一切合理且必要的措施，仍然有可能无法杜绝您的用户信息被非法访问、非法盗取、非法篡改或毁坏，导致您的合法权益受损，请您理解信息网络的上述风险并自愿承担。
		<br/>7、在我们采取必要合理的安全保护措施后，仍不幸发生信息泄露等安全事件，我们将按照法律法规的要求，及时向您告知：安全事件的基本情况和可能的影响、我们已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。难以逐一告知时，我们将会采取合理、有效的方式发布公告。同时，我们还将按照监管部门要求，主动上报信息安全事件的处置情况。
		<br/>（2）高德开放平台：由阿里巴巴旗下的高德开放平台提供位置定位请求技术服务，我们可能获取WLAN状态信息、定位信息、终端设备唯一标识符，系统版本，以便给开发者返回最终用户的位置信息并向最终用户提供定位服务；会使用各种技术进行定位，包括IP地址、GNSS、以及能够提供相关信息的其他传感器（如可能会为高德提供附近设备、WLAN接入点和基站的信息）（此产品的隐私政策条款，可参考https://lbs.amap.com/pages/privacy/）<br/>
		<text class="titleB sy_title_deep">（三）您可以通过关闭定位功能，停止对您的地理位置信息的收集。</text><br/>
		<br/><text class="titleA sy_title_deep">二、我们可能如何使用信息</text><br/>
		<text class="titleB sy_title_deep">（一）我们可能将在向您提供服务的过程之中所收集的信息用作下列用途：</text>
		1、向您提供服务；
		2、在我们提供服务时，用于身份验证、客户服务、安全防范、诈骗监测、存档和备份用途，确保我们向您提供的产品和服务的安全性；
		3、帮助我们设计新服务，改善我们现有服务； 
		4、让您参与有关我们产品和服务的调查。
		<br/><text class="titleA sy_title_deep">三、您如何访问和控制自己的个人信息</text><br/>
		我们将尽一切可能采取适当的技术手段，保证您可以访问、更新和更正自己的注册信息或使用我们的服务时提供的其他个人信息。在访问、更新、更正和删除前述信息时，我们可能会要求您进行身份验证，以保障账户安全。
		<br/><text class="titleA sy_title_deep">四、我们可能分享的信息</text><br/>
		<text class="titleB sy_title_deep">（一）除以下情形外，未经您同意，我们不会与任何第三方分享您的个人信息：</text>
		1、我们可能将您的个人信息与第三方服务供应商、承包商及代理（例如代表我们发出电子邮件或推送通知的通讯服务提供商、为我们提供位置数据的地图服务供应商）分享（他们可能并非位于您所在的区域），用作下列用途：
		（1）向您提供我们的服务；
		（2）实现“我们可能如何使用信息”部分所述目的；
		（3）履行我们在本《隐私政策》中的义务和行使我们的权利；
		（4）理解、维护和改善我们的服务。
		2、如我们与任何上述第三方分享您的个人信息，我们将努力确保该等第三方在使用您的个人信息时遵守本《隐私政策》及我们要求其遵守的其他适当的保密和安全措施。
		3、随着我们业务的持续发展，我们有可能进行合并、收购、资产转让或类似的交易，您的个人信息有可能作为此类交易的一部分而被转移。我们将在转移前通知您。
		<text class="titleB sy_title_deep">（二）我们还可能为以下需要而保留、保存或披露您的个人信息：</text>
		1、遵守适用的法律法规；
		2、遵守法院命令或其他法律程序的规定；
		3、遵守相关政府机关的要求；
		4、为遵守适用的法律法规、维护社会公共利益，或保护我们的客户、我们、其他用户的人身和财产安全或合法权益所合理必需的用途。
		<br/><text class="titleA sy_title_deep">五、信息安全</text><br/>
		我们仅在本《隐私政策》所述目的所必需的期间和法律法规要求的时限内保留您的个人信息。 我们使用各种安全技术和程序，以防信息的丢失、不当使用、未经授权阅览或披露。例如，在某些服务中，我们将利用加密技术（例如SSL）来保护您提供的个人信息。但请您理解，由于技术的限制以及可能存在的各种恶意手段，在互联网行业，即便竭尽所能加强安全措施，也不可能始终保证信息百分之百的安全。您需要了解，您接入我们的服务所用的系统和通讯网络，有可能因我们可控范围外的因素而出现问题。		
		<br/><text class="titleA sy_title_deep">六、您分享的信息</text><br/>
		我们的多项服务，可让您不仅与自己的社交网络，也与使用该服务的所有用户公开分享您的相关信息，例如，您在我们的服务中所上传或发布的信息（包括您公开的个人信息、您建立的名单）、您对其他人上传或发布的信息作出的回应，以及包括与这些信息有关的位置数据和日志信息。使用我们服务的其他用户也有可能分享与您有关的信息（包括位置数据和日志信息）。只要您不删除共享信息，有关信息会一直留存在公共领域；即使您删除共享信息，有关信息仍可能由其他用户或不受我们控制的非关联第三方独立地缓存、复制或储存，或由其他用户或该等第三方在公共领域保存。
		因此，请您谨慎考虑通过我们的服务上传、发布和交流的信息内容。在一些情况下，您可通过我们某些服务的隐私设定来控制有权浏览您共享信息的用户范围。如要求从我们的服务中删除您的相关信息，请通过该等特别服务条款提供的方式操作。
		<br/><text class="titleA sy_title_deep">七、您分享的敏感个人信息</text><br/>
		（一）某些个人信息因其特殊性可能被认为是敏感个人信息，例如您的种族、个人健康和医疗信息等。相比其他个人信息，敏感个人信息受到更加严格的保护。
		（二）请注意，您在使用我们的服务时所提供、上传或发布的内容和信息（例如有关您社交活动的照片等信息），可能会泄露您的敏感个人信息。您需要谨慎地考虑，是否在使用我们的服务时披露相关敏感个人信息。
		（三）您同意按本《隐私政策》所述的目的和方式来处理您的敏感个人信息。
		<br/><text class="titleA sy_title_deep">八、我们可能如何收集信息</text><br/>
		（一）我们或我们的第三方合作伙伴，可能通过cookies和web beacon收集和使用您的信息，并将该等信息储存为日志信息。
		（二）我们使用自己的cookies和web beacon，目的是为您提供更优质的用户体验和服务，并用于以下用途：
		1、记住您的身份。例如：cookies和web beacon有助于我们辨认您作为我们的注册用户的身份，或保存您向我们提供的有关您的其他信息；
		2、分析您使用我们服务的情况。例如，我们可利用cookies和web beacon来了解您使用我们的服务进行什么活动；
		3、我们的产品和服务上可能会有广告商或其他合作方放置的cookies和web beacon。这些cookies和web beacon可能会收集与您相关的非个人身份信息，以用于分析用户如何使用等服务。这些第三方cookies和web beacon收集和使用该等信息，不受本《隐私政策》约束，而是受相关使用者的隐私政策约束，我们不对第三方的cookies或web beacon承担责任。
		（三）您可以通过浏览器设置拒绝或管理cookies或web beacon。但请注意，如果停用cookies或web beacon，您有可能无法享受最佳的服务体验，某些服务也可能无法正常使用。
		<br/><text class="titleA sy_title_deep">九、邮件和信息推送</text><br/>
		您在使用我们的服务时，我们可能使用您的信息向您的设备发送电子邮件、新闻或推送通知。如您不希望收到这些信息，可以按照我们的相关提示，在设备上选择取消订阅。
		<br/><text class="titleA sy_title_deep">十、账号注销</text><br/>
		用户在已持有账号的情况下，不论是通过手机号注册还是通过第三方工具，如微信等注册。用户需要注销该账号时，请通过软件内”我的”=》“关于树蚁”=》“联系客服”模块，通过选择微信客服或者电话客服联系我们注销本人账户，我们需要核实确实是您本人的账号并确定要注销的情况下，在14个工作日内帮助您注销账号。注销成功后，该账号内的数据会被删除掉，该账号如果需要重新使用，则需要重新注册，信息审核等初始化流程。该条款，请用户慎重执行！
		<br/><text class="titleA sy_title_deep">十一、与服务有关的公告</text><br/>
		我们可能在必要时（例如因系统维护而暂停某一项服务时）向您发出与服务有关的公告。您可能无法取消这些与服务有关、性质不属于推广的公告。
		<br/><text class="titleA sy_title_deep">十二、隐私政策的适用例外</text><br/>
		我们的服务可能包括或链接至第三方提供的社交媒体或其他服务（包括网站）。例如：
		（一）您利用“分享”键将某些内容分享到我们的服务，或您利用第三方连线服务登录我们的服务。这些功能可能会收集您的相关信息（包括您的日志信息），并可能在您的电脑装置cookies，从而正常运行上述功能；
		（二）该等第三方社交媒体或其他服务可能由相关的第三方或我们运营。您使用该等第三方的社交媒体服务或其他服务（包括您向该等第三方提供的任何个人信息），须受该第三方的服务条款及隐私政策（而非《通用服务条款》或本《隐私政策》）约束，您需要仔细阅读其条款。本《隐私政策》仅适用于我们所收集的信息，并不适用于任何第三方提供的服务或第三方的信息使用规则，我们对任何第三方使用由您提供的信息不承担任何责任。
		<br/><text class="titleA sy_title_deep">十三、隐私政策的适用范围</text><br/>
		（一）除某些特定服务外，我们所有的服务均适用本《隐私政策》。这些特定服务将适用特定的隐私政策。针对某些特定服务的特定隐私政策，将更具体地说明我们在该等服务中如何使用您的信息。该特定服务的隐私政策构成本《隐私政策》的一部分。如相关特定服务的隐私政策与本《隐私政策》有不一致之处，适用该特定服务的隐私政策。
		（二）请您注意，本《隐私政策》不适用于以下情况：
		1、通过我们的服务而接入的第三方服务（包括任何第三方网站）收集的信息；
		2、通过在我们服务中进行广告服务的其他公司或机构所收集的信息。
		<br/><text class="titleA sy_title_deep">十四、变更</text><br/>
		我们可能适时修订本《隐私政策》的条款，该等修订构成本《隐私政策》的一部分。如该等修订造成您在本《隐私政策》下权利的实质减少，我们将在修订生效前通过在主页上显著位置提示或向您发送电子邮件或以其他方式通知您。在该种情况下，若您继续使用我们的服务，即表示同意受本《隐私政策》的约束。
		<br/><text class="titleA sy_title_deep">十五、如何联系我们</text><br/>
		如您对本隐私政策或您个人信息的相关事宜有任何问题、意见或建议，请通过通过<text class="address">https://www.shoyii.com</text>与我们联系。 
		<!-- #endif -->
		<!-- #ifdef MP-WEIXIN -->
		<view class="" style="text-align: center;padding: 30rpx 0;">
			<text style="color: #000000;font-size: 36rpx;font-weight: bold;">树蚁小程序隐私保护指引</text>
		</view>
		
		本指引是树蚁小程序开发者收集、使用和存储你的信息而制定。
		
		开发者收集的信息根据法律规定，开发者仅收集实现小程序功能所必要的信息。
		开发者收集你的用户信息（微信昵称、头像、性别、地区），用于注册、登录小程序。
		开发者收集你的手机号码，用于网约车司机与你取得联系。
		开发者收集你的身份证号码，用于法律实名制要求，为你提供车票购买服务。
		开发者对信息的存储
		存储地点境内
		存储期限小程序停止运营后及时删除
		信息的使用规则
		开发者将会在本指引所涵盖的用途内使用收集的信息。
		
		如开发者使用你的信息超出本指引目的或合理范围，会及时更新本指引，同时，开发者在使用你的信息前，再次以小程序浮窗等方式告知并征得你的明示同意
		
		信息对外提供
		开发者承诺
		
		- 不会主动共享或转让你的信息至任何第三方，如存在确需共享或转让时，开发者应当直接或确认第三方征得你的明示同意。
		
		- 不会对外公开披露你的信息，如必须公开披露时，开发者应当向你告知公开披露的目的、披露信息的类型及可能涉及的信息，并征得你的明示同意
		
		若你认为开发者未遵守上述约定，或有其他的投诉建议、未成年人个人信息相关问题，可通过以下方式与开发者联系；或者向微信进行投诉。
		<!-- #endif -->
		</view>
	</view>
</template>

<script>
	export default{
		onBackPress(e){
			console.log(e)
			// #ifdef H5
			if(e.from === 'backbutton'){//
				uni.showToast({
					title:'无效',
					icon:'none'
				})
			}
			return true
			// #endif
		},
		onReady() {
			this.amendNavigator()
		}
	}
</script>

<style scoped>
	.page{
		padding: 0 20rpx;
		line-height: 24px;
	}
	.Alltitle{
		padding: 20rpx 0;text-align: center;font-weight: bold;font-size: 16px;
	}
	.time{
		text-align: center;
		font-size: 12px;
		color: #86B0D4;
	}
	.subtitle{
		text-align: center;
		color: #000000;
		font-size: 30rpx;
		font-weight: bold;
		padding: 20rpx 0;
	} 
	.titleA{
		color: #000000;
		font-size: 32rpx;
		font-weight: bold;
		line-height: 80rpx;
	}
	.titleB{
		color: #000000;
		font-size: 28rpx;
		font-weight: bold;
	}
	.address{
		color: #86B0D4;
	}
</style>
