<template>
	<view class="userAgree" :data-theme='themeType'>
		<view class="titleA sy_title_primary" style="text-align: center;">
			<text>用户协议</text>
		</view>
		<text class="sy_title_primary">请您使用本产品之前，请务必仔细阅读并理解《用户协议》（以下简称“本协议”）中规定的多有权利和限制。
			 我们一向尊重并会严格保护用户在使用本产品时的合法权益（包括用户隐私、用户数据等）不受到任何侵犯。
			 本协议是用户（以下简称“用户”或“您”）与广州诺曼数字化医疗科技有限公司（以下简称为”本客户端”）之间针对本产品相关事项所订立的协议。请您仔细阅读本注册协议，本协议即构成对双方有约束力的法律文件。
		</text>
		<view class="sy_title_primary">
			<view class="titleA sy_title_deep">
				<text class="">第1条 服务条款的确认和接纳</text>
			</view>
			<text>1.1. 本客户端的各项服务的所有权和运作权归广州诺曼数字化医疗科技有限公司所有。用户同意所有注册协议条款并完成注册程序，才能成为本客户端的正式用户。用户确认：本协议条款是处理双方权利义务的契约，始终有效，法律另有强制性规定或双方另有特别约定的，依其规定。</text><br/>
			<text>1.2. 用户点击同意本协议的，即视为用户确认自己具有享受本客户端服务、下单购买等相应的权利能力和行为能力，能够独立承担法律责任。</text><br/>
			<text>1.3. 本客户端保留在中华人民共和国大陆地区法施行之法律允许的范围内独自决定拒绝服务、关闭用户账户、清除或编辑内容或取消订单的权利。</text><br/>
		</view>
		<view class="sy_title_primary">
			<view class="titleA sy_title_deep">
				<text class="">第2条 本客户端服务</text>
			</view>
			<text>2.1. 本客户端通过互联网依法为用户提供互联网信息等服务，用户在完全同意本协议及本客户端规定的情况下，方有权使用本客户端的相关服务。</text><br/>
			<text>2.2. 用户必须自行准备如下设备和承担如下开支： （1）上网设备，包括并不限于电脑或者其他上网终端、调制解调器及其他必备的上网装置；
  （2）上网开支，包括并不限于网络接入费、上网设备租用费、手机流量费等。
</text><br/>
		</view>
		<view class="sy_title_primary">
			<view class="titleA sy_title_deep">
				<text class="">第3条用户信息</text>
			</view>
			<text>3.1. 用户应自行诚信向本客户端提供注册资料，用户同意其提供的注册资料真实、准确、完整、合法有效，用户注册资料如有变动的，应及时更新其注册资料。如果用户提供的注册资料不合法、不真实、不准确、不详尽的，用户需承担因此引起的相应责任及后果，并且本客户端保留终止用户使用各项服务的权利。</text><br/>
			<text>3.2. 用户在本客户端进行购买活动时，涉及用户真实姓名/名称、通信地址、联系电话、电子邮箱等隐私信息的，本站将予以严格保密，除非得到用户的授权或法律另有规定，本站不会向外界披露用户隐私信息。</text><br/>
			<text>3.3. 用户注册成功后，将产生用户名和密码等账户信息，您可以根据本客户端规定改变您的密码。用户应谨慎合理的保存、使用其用户名和密码。用户若发现任何非法使用用户账号或存在安全漏洞的情况，请立即通知本客户端并向公安机关报案。</text><br/>
			<text>3.4. 用户同意，本客户端拥有通过邮件、短信电话等形式，向在本客户端注册、购买的用户发送信息、促销活动等告知信息的权利。</text><br/>
			<text>3.5. 用户不得将在本站注册获得的账户借给他人使用，否则用户应承担由此产生的全部责任，并与实际使用人承担连带责任。</text><br/>
			<text>3.6. 用户同意，本客户端有权使用用户的注册信息、用户名、密码等信息，登陆进入用户的注册账户，进行证据保全，包括但不限于公证、见证等。</text><br/>
		</view>
		<view class="sy_title_primary">
			<view class="titleA sy_title_deep">
				<text class="">第4条用户依法言行义务</text>
			</view>
			<text>本协议依据国家相关法律法规规章制定，用户同意严格遵守以下义务：</text><br/>
			<text>（1）不得传输或发表：煽动抗拒、破坏宪法和法律、行政法规实施的言论，煽动颠覆国家政权，推翻社会主义制度的言论，煽动分裂国家、破坏国家统一的的言论，煽动民族仇恨、民族歧视、破坏民族团结的言论；</text><br/>
			<text>（2）从中国大陆向境外传输资料信息时必须符合中国有关法规；</text><br/>		
			<text>（3）不得利用本客户端从事洗钱、窃取商业秘密、窃取个人信息等违法犯罪活动；</text><br/>
			<text>（4）不得干扰本客户端的正常运转，不得侵入本客户端及国家计算机信息系统；</text><br/>
			<text>（5）不得传输或发表任何违法犯罪的、骚扰性的、中伤他人的、辱骂性的、恐吓性的、伤害性的、庸俗的、淫秽的、不文明的等信息资料；</text><br/>
			<text>（6）不得传输或发表损害国家社会公共利益和涉及国家安全的信息资料或言论；</text><br/>
			<text>（7）不得教唆他人从事本条所禁止的行为；</text><br/>
			<text>（8）不得利用在本客户端注册的账户进行牟利性经营活动；</text><br/>
			<text>（9）不得发布任何侵犯他人著作权、商标权等知识产权或合法权利的内容；用户应关注并遵守本客户端不时公布或修改的各类合法规则规定。本客户端保有删除各类不符合法律政策或不真实的信息内容而无须通知用户的权利。若用户未遵守以上规定的，本客户端有权作出独立判断并采取暂停或关闭用户帐号等措施。用户须对自己在网上的言论和行为承担法律责任。</text><br/>
		</view>
		<view class="sy_title_primary">
			<view class="titleA sy_title_deep">
				<text class="">第5条所有权及知识产权条款</text>
			</view>
			<text>5.1. 用户一旦接受本协议，即表明该用户主动将其在任何时间段在本客户端发表的任何形式的信息内容（包括但不限于客户评价、客户咨询、各类话题文章等信息内容）的财产性权利等任何可转让的权利，如著作权财产权（包括并不限于：复制权、发行权、出租权、展览权、表演权、放映权、广播权、信息网络传播权、摄制权、改编权、翻译权、汇编权以及应当由著作权人享有的其他可转让权利），全部独家且不可撤销地转让给本客户端所有，用户同意本客户端有权就任何主体侵权而单独提起诉讼.</text><br/>
			<text>5.2. 本协议已经构成《中华人民共和国著作权法》第二十五条（条文序号依照2011年版著作权法确定）及相关法律规定的著作财产权等权利转让书面协议，其效力及于用户在本客户端上发布的任何受著作权法保护的作品内容，无论该等内容形成于本协议订立前还是本协议订立后。</text><br/>
			<text>5.3. 用户同意并已充分了解本协议的条款，承诺不将已发表于本客户端的信息，以任何形式发布或授权其它主体以任何方式使用（包括但限于在各类网站、媒体上使用）。</text><br/>
			<text>5.4. 广州诺曼数字化医疗科技有限公司是本客户端的制作者，拥有此客户端内容及资源的著作权等合法权利，受国家法律保护，有权不时地对本协议及本客户端的内容进行修改，并在本客户端张贴，无须另行通知用户。在法律允许的最大限度范围内，广州诺曼数字化医疗科技有限公司对本协议及本客户端内容拥有解释权。</text><br/>
			<text>5.5. 除法律另有强制性规定外，未经本客户端明确的特别书面许可，任何单位或个人不得以任何方式非法地全部或部分复制、转载、引用、链接、抓取或以其他方式使用本客户端的信息内容，否则，本客户端有权追究其法律责任。</text><br/>
			<text>5.6. 本客户端所刊登的资料信息（诸如文字、模型、标识、图像、视频片段、文件下载），均是本客户端或其内容提供者的财产，受中国和国际版权法的保护。本客户端上所有内容的汇编是本客户端的排他财产，受中国和国际版权法的保护。本客户端上所有软件都是广州诺曼数字化医疗科技有限公司或其关联公司或其软件供应商的财产，受中国和国际版权法的保护。</text><br/>
		</view>
		<view class="sy_title_primary">
			<view class="titleA sy_title_deep">
				<text class="">第6条责任限制及不承诺担保</text>
			</view>
			<text>•	除非另有明确的书面说明，本客户端及其所包含的或以其它方式通过本客户端提供给您的全部信息、内容、材料、产品（包括软件）和服务，均是在“按现状”和“按现有”的基础上提供的。除非另有明确的书面说明，广州诺曼数字化医疗科技有限公司不对本客户端的运营及其包含在本客户端上的信息、内容、材料、产品（包括软件）或服务作任何形式的、明示或默示的声明或担保（根据中华人民共和国法律另有规定的以外）。</text><br/>
			<text>
		•	广州诺曼数字化医疗科技有限公司不担保本客户端所包含的或以其它方式通过本客户端提供给您的全部信息、内容、材料、产品（包括软件）和服务、其服务器或从本客户端发出的电子信件、信息没有病毒或其他有害成分。如因不可抗力或其它本站无法控制的原因使本客户端销售系统崩溃或无法正常使用导致网上交易无法完成或丢失有关的信息、记录等，本客户端会合理地尽力协助处理善后事宜。</text><br/>
			<text>•	广州诺曼数字化医疗科技有限公司所有信息仅供参考，不做个别诊断和使用的根据。</text><br/>
			<text>•	广州诺曼数字化医疗科技有限公司致力于提供正确、完整的健康资讯，但不保证信息的正确性和完整性，且不对因信息的不正确或遗漏导致的任何损失或损害承担责任。</text><br/>
			<text>•	本客户端所提供的任何医疗信息，仅供参考，不能替代医生和其他医务人员的建议，如自行使用本客户端中资料发生偏差，广州诺曼数字化医疗科技有限公司概不负责，亦不负任何法律责任。</text><br/>
		</view>
		<view class="sy_title_primary">
			<view class="titleA sy_title_deep">
				<text class="">第7条协议更新及用户关注义务</text>
			</view>
			<text>根据国家法律法规变化及网络运营需要，广州诺曼数字化医疗科技有限公司有权对本协议条款不时地进行修改，修改后的协议一旦被张贴在本客户端上即生效，并代替原来的协议。用户可随时登陆查阅最新协议；用户有义务不时关注并阅读最新版的协议及客户端公告。如用户不同意更新后的协议，可以且应立即停止接受本客户端依据本协议提供的服务；如用户继续使用本客户端提供的服务，即视为同意更新后的协议。广州诺曼数字化医疗科技有限公司建议您在使用本客户端之前阅读本协议及本客户端的公告。如果本协议中任何一条被视为废止、无效或因任何理由不可执行，该条应视为可分的且并不影响任何其余条款的有效性和可执行性。</text><br/>
		</view>
		<view class="sy_title_primary">
			<view class="titleA sy_title_deep">
				<text class="">第8条法律管辖和适用</text>
			</view>
			<text>本协议的订立、执行和解释及争议的解决均应适用在中华人民共和国大陆地区适用之有效法律（但不包括其冲突法规则）。如发生本协议与适用之法律相抵触时，则这些条款将完全按法律规定重新解释，而其它有效条款继续有效。如缔约方就本协议内容或其执行发生任何争议，双方应尽力友好协商解决；协商不成时，任何一方均可向有管辖权的中华人民共和国大陆地区法院提起诉讼。</text><br/>
		</view>
		<view class="sy_title_primary">
			<view class="titleA sy_title_deep">
				<text class="">第9条其他</text>
			</view>
			<text>9.1. 本客户端所有者是指在政府部门依法许可或备案的广州诺曼数字化医疗科技有限公司经营主体。</text><br/>
			<text>9.2. 广州诺曼数字化医疗科技有限公司尊重用户和消费者的合法权利，本协议及本客户端上发布的各类规则、声明等其他内容，均是为了更好的、更加便利的为用户和消费者提供服务。本客户端欢迎用户和社会各界提出意见和建议，广州诺曼数字化医疗科技有限公司将虚心接受并适时修改本协议及本客户端的各类规则。</text><br/>
			<text>9.3. 本协议内容中以黑体、加粗、下划线、斜体等方式显著标识的条款，请用户着重阅读。</text><br/>
			<text>9.4. 您点击本协议上方的“同意以下协议，提交”按钮即视为您完全接受本协议，在点击之前请您再次确认已知悉并完全理解本协议的全部内容。</text><br/>
		</view>
		<view class="sy_title_primary" style="padding: 30rpx 0;">
			<text>广州诺曼数字化医疗科技有限公司</text><br/>
			<text>2020.12.22</text>
		</view>
	</view>
</template>

<script>
	export default{
		onBackPress(e){
			console.log(e)
			// #ifdef H5
			if(e.from === 'backbutton'){//导航栏返回键及物理键
				uni.showToast({
					title:'无效',
					icon:'none'
				})
			}
			return true
			// #endif
		},
		onReady() {
			this.amendNavigator()
		}
	}
</script>

<style scoped>
	.userAgree{
		padding: 0 30rpx;	
		font-size: 13px;
		line-height: 20px;
		width: 100%;
		/* #ifdef H5 */
		min-height: 100%; 
		/* #endif */
		/* #ifndef H5 */
		min-height: 100vh;
		/* #endif */
	}

	.titleA{
		font-size: 15px;
		color: #000000;
		font-weight: bold;
		font-family: PingFang-SC-Bold;
		padding: 20rpx 0;
		
	}
</style>
